Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFF124.atdf
      <value-group caption="FIFO Selection bits" name="C2FLTCON0__FSEL0">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 0 Mask Select bits" name="C2FLTCON0__MSEL0">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 0 Enable bit" name="C2FLTCON0__FLTEN0">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON0__FSEL1">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 1 Mask Select bits" name="C2FLTCON0__MSEL1">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 1 Enable bit" name="C2FLTCON0__FLTEN1">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON0__FSEL2">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 2 Mask Select bits" name="C2FLTCON0__MSEL2">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 2 Enable bit" name="C2FLTCON0__FLTEN2">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON0__FSEL3">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 3 Mask Select bits" name="C2FLTCON0__MSEL3">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 3 Enable bit" name="C2FLTCON0__FLTEN3">
         <value caption="Filter is enabled" name="" value="0x1L"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON1__FSEL4">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 4 Mask Select bits" name="C1FLTCON1__MSEL4">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 4 Enable bit" name="C1FLTCON1__FLTEN4">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON1__FSEL5">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
