Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFF124.atdf
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
         <value caption="Initiate an oscillator switch to selection specified by NOSC bits" name="" value="0x1"/>
         <value caption="Oscillator switch is complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="OSCCON__SOSCEN">
         <value caption="Enable Secondary Oscillator" name="" value="0x1"/>
         <value caption="Disable Secondary Oscillator" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="OSCCON__CF">
         <value caption="FSCM has detected a clock failure" name="" value="0x1"/>
         <value caption="No clock failure has been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sleep Mode Enable bit" name="OSCCON__SLPEN">
         <value caption="Device will enter Sleep mode when a WAIT instruction is executed" name="" value="0x1"/>
         <value caption="Device will enter Idle mode when a WAIT instruction is executed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Selection Lock Enable bit" name="OSCCON__CLKLOCK">
         <value caption="Clock and PLL selections are locked" name="" value="0x1"/>
         <value caption="Clock and PLL selections are not locked and may be modified" name="" value="0x0"/>
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="" value="0x5"/>
         <value caption="Secondary Oscillator (Sosc)" name="" value="0x4"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Primary Oscillator (Posc) (HS or EC)" name="" value="0x2"/>
         <value caption="System PLL (SPLL)" name="" value="0x1"/>
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Current Oscillator Selection bits" name="OSCCON__COSC">
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="" value="0x7"/>
         <value caption="Back-up Fast RC (BFRC) Oscillator" name="" value="0x6"/>
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="" value="0x5"/>
         <value caption="Secondary Oscillator (Sosc)" name="" value="0x4"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Primary Oscillator (Posc) (HS or EC)" name="" value="0x2"/>
         <value caption="System PLL (SPLL)" name="" value="0x1"/>
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sleep 2-speed Startup Control bit" name="OSCCON__SLP2SPD">
         <value caption="Use FRC as SYSCLK until selected clock is ready" name="" value="0x1"/>
         <value caption="Use the selected clock directly" name="" value="0x0"/>
      </value-group>
      <value-group caption="Dream Mode Enable bit" name="OSCCON__DRMEN">
         <value caption="Dream mode is enabled" name="" value="0x1"/>
         <value caption="Dream mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Internal Fast RC Oscillator Clock Divider" name="OSCCON__FRCDIV">
         <value caption="FRC divided by 256" name="OSC_FRC_DIV_256" value="0x7"/>
         <value caption="FRC divided by 64" name="OSC_FRC_DIV_64" value="0x6"/>
         <value caption="FRC divided by 32" name="OSC_FRC_DIV_32" value="0x5"/>
         <value caption="FRC divided by 16" name="OSC_FRC_DIV_16" value="0x4"/>
         <value caption="FRC divided by 8" name="OSC_FRC_DIV_8" value="0x3"/>
         <value caption="FRC divided by 4" name="OSC_FRC_DIV_4" value="0x2"/>
         <value caption="FRC divided by 2" name="OSC_FRC_DIV_2" value="0x1"/>
         <value caption="FRC divided by 1 (default setting)" name="OSC_FRC_DIV_1" value="0x0"/>
      </value-group>
      <value-group caption="FRC Oscillator Tuning bits" name="OSCTUN__TUN">
         <value caption="Center frequency -2%" name="" value="0x20"/>
         <value caption="Center frequency; Oscillator runs at nominal frequency (8 MHz)" name="" value="0x0"/>
         <value caption="Center frequency +2%" name="" value="0x1f"/>
      </value-group>
      <value-group caption="System PLL Frequency Range Selection bits" name="SPLLCON__PLLRANGE">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="34-64 MHz" name="" value="0x5"/>
         <value caption="21-42 MHz" name="" value="0x4"/>
         <value caption="13-26 MHz" name="" value="0x3"/>
         <value caption="8-16 MHz" name="" value="0x2"/>
         <value caption="5-10 MHz" name="" value="0x1"/>
         <value caption="Bypass" name="" value="0x0"/>
      </value-group>
      <value-group caption="System PLL Input Clock Source bit" name="SPLLCON__PLLICLK">
         <value caption="FRC is selected as the input to the System PLL" name="" value="0x1"/>
         <value caption="Posc is selected as the input to the System PLL" name="" value="0x0"/>
      </value-group>
      <value-group caption="System PLL Input Clock Divider bits" name="SPLLCON__PLLIDIV">
         <value caption="Divide by 8" name="" value="0x7"/>
         <value caption="Divide by 7" name="" value="0x6"/>
         <value caption="Divide by 6" name="" value="0x5"/>
         <value caption="Divide by 5" name="" value="0x4"/>
         <value caption="Divide by 4" name="" value="0x3"/>
         <value caption="Divide by 3" name="" value="0x2"/>
         <value caption="Divide by 2" name="" value="0x1"/>
         <value caption="Divide by 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="System PLL Multiplier bits" name="SPLLCON__PLLMULT">
         <value caption="Multiply by 128" name="" value="0x7f"/>
         <value caption="Multiply by 127" name="" value="0x7e"/>
         <value caption="Multiply by 126" name="" value="0x7d"/>
         <value caption="Multiply by 125" name="" value="0x7c"/>
         <value caption="Multiply by 2" name="" value="0x1"/>
         <value caption="Multiply by 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="System PLL Output Clock Divider bits" name="SPLLCON__PLLODIV">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="PLL Divide by 32" name="" value="0x5"/>
         <value caption="PLL Divide by 16" name="" value="0x4"/>
         <value caption="PLL Divide by 8" name="" value="0x3"/>
         <value caption="PLL Divide by 4" name="" value="0x2"/>
         <value caption="PLL Divide by 2" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
