Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFF124.atdf
         <register caption="Interrupt Priority Control Registe" name="IPC23" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD33IS"/>
            <bitfield mask="0x0000001C" name="ADCD33IP"/>
            <bitfield mask="0x00000300" name="ADCD34IS"/>
            <bitfield mask="0x00001C00" name="ADCD34IP"/>
            <bitfield mask="0x00030000" name="ADCD35IS"/>
            <bitfield mask="0x001C0000" name="ADCD35IP"/>
            <bitfield mask="0x03000000" name="ADCD36IS"/>
            <bitfield mask="0x1C000000" name="ADCD36IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC24" offset="0x2c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD37IS"/>
            <bitfield mask="0x0000001C" name="ADCD37IP"/>
            <bitfield mask="0x00000300" name="ADCD38IS"/>
            <bitfield mask="0x00001C00" name="ADCD38IP"/>
            <bitfield mask="0x00030000" name="ADCD39IS"/>
            <bitfield mask="0x001C0000" name="ADCD39IP"/>
            <bitfield mask="0x03000000" name="ADCD40IS"/>
            <bitfield mask="0x1C000000" name="ADCD40IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC25" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD41IS"/>
            <bitfield mask="0x0000001C" name="ADCD41IP"/>
            <bitfield mask="0x00000300" name="ADCD42IS"/>
            <bitfield mask="0x00001C00" name="ADCD42IP"/>
            <bitfield mask="0x00030000" name="ADCD43IS"/>
            <bitfield mask="0x001C0000" name="ADCD43IP"/>
            <bitfield mask="0x03000000" name="ADCD44IS"/>
            <bitfield mask="0x1C000000" name="ADCD44IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC26" offset="0x2e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CPCIS"/>
            <bitfield mask="0x0000001C" name="CPCIP"/>
            <bitfield mask="0x00000300" name="CFDCIS"/>
            <bitfield mask="0x00001C00" name="CFDCIP"/>
            <bitfield mask="0x00030000" name="SBIS"/>
            <bitfield mask="0x001C0000" name="SBIP"/>
            <bitfield mask="0x03000000" name="CRPTIS"/>
            <bitfield mask="0x1C000000" name="CRPTIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC27" offset="0x2f0" rw="RW" size="4">
            <bitfield mask="0x00000300" name="SPI1EIS"/>
            <bitfield mask="0x00001C00" name="SPI1EIP"/>
            <bitfield mask="0x00030000" name="SPI1RXIS"/>
            <bitfield mask="0x001C0000" name="SPI1RXIP"/>
            <bitfield mask="0x03000000" name="SPI1TXIS"/>
            <bitfield mask="0x1C000000" name="SPI1TXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC28" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U1EIS"/>
            <bitfield mask="0x0000001C" name="U1EIP"/>
            <bitfield mask="0x00000300" name="U1RXIS"/>
            <bitfield mask="0x00001C00" name="U1RXIP"/>
            <bitfield mask="0x00030000" name="U1TXIS"/>
            <bitfield mask="0x001C0000" name="U1TXIP"/>
            <bitfield mask="0x03000000" name="I2C1BIS"/>
            <bitfield mask="0x1C000000" name="I2C1BIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC29" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C1SIS"/>
            <bitfield mask="0x0000001C" name="I2C1SIP"/>
            <bitfield mask="0x00000300" name="I2C1MIS"/>
            <bitfield mask="0x00001C00" name="I2C1MIP"/>
            <bitfield mask="0x00030000" name="CNAIS"/>
            <bitfield mask="0x001C0000" name="CNAIP"/>
            <bitfield mask="0x03000000" name="CNBIS"/>
            <bitfield mask="0x1C000000" name="CNBIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC30" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CNCIS"/>
            <bitfield mask="0x0000001C" name="CNCIP"/>
            <bitfield mask="0x00000300" name="CNDIS"/>
            <bitfield mask="0x00001C00" name="CNDIP"/>
            <bitfield mask="0x00030000" name="CNEIS"/>
            <bitfield mask="0x001C0000" name="CNEIP"/>
            <bitfield mask="0x03000000" name="CNFIS"/>
            <bitfield mask="0x1C000000" name="CNFIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC31" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CNGIS"/>
            <bitfield mask="0x0000001C" name="CNGIP"/>
            <bitfield mask="0x00000300" name="CNHIS"/>
            <bitfield mask="0x00001C00" name="CNHIP"/>
            <bitfield mask="0x00030000" name="CNJIS"/>
            <bitfield mask="0x001C0000" name="CNJIP"/>
            <bitfield mask="0x03000000" name="CNKIS"/>
            <bitfield mask="0x1C000000" name="CNKIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC32" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PMPIS"/>
            <bitfield mask="0x0000001C" name="PMPIP"/>
            <bitfield mask="0x00000300" name="PMPEIS"/>
            <bitfield mask="0x00001C00" name="PMPEIP"/>
            <bitfield mask="0x00030000" name="CMP1IS"/>
            <bitfield mask="0x001C0000" name="CMP1IP"/>
            <bitfield mask="0x03000000" name="CMP2IS"/>
            <bitfield mask="0x1C000000" name="CMP2IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC33" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000003" name="USBIS"/>
            <bitfield mask="0x0000001C" name="USBIP"/>
            <bitfield mask="0x00000300" name="USBDMAIS"/>
            <bitfield mask="0x00001C00" name="USBDMAIP"/>
            <bitfield mask="0x00030000" name="DMA0IS"/>
            <bitfield mask="0x001C0000" name="DMA0IP"/>
            <bitfield mask="0x03000000" name="DMA1IS"/>
            <bitfield mask="0x1C000000" name="DMA1IP"/>
         </register>
